### Deployment Results :white_check_mark:

 **GrantBirki** successfully **branch** deployed branch `main` to **production**





<details><summary>Show Results</summary>

```terraform
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # cloudflare_record.cache has changed
  ~ resource "cloudflare_record" "cache" {
        id              = "180e6c5a5414843333d449244962bf01"
      ~ modified_on     = "2024-03-10T23:38:24.520299Z" -> "2024-03-10T23:48:48.384528Z"
        name            = "cache"
        # (10 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record.cache must be replaced
-/+ resource "cloudflare_record" "cache" {
      ~ created_on      = "2024-03-10T23:38:24.520299Z" -> (known after apply)
      ~ hostname        = "cache.tarkov.dev" -> (known after apply)
      ~ id              = "180e6c5a5414843333d449244962bf01" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
      ~ modified_on     = "2024-03-10T23:48:48.384528Z" -> (known after apply)
        name            = "cache"
      ~ proxiable       = true -> (known after apply)
      ~ type            = "CNAME" -> "A" # forces replacement
      ~ value           = "tarkov-cache.azurewebsites.net" -> "20.124.115.39"
        # (4 unchanged attributes hidden)
    }

  # cloudflare_record.cache_azure_function_verification will be destroyed
  # (because cloudflare_record.cache_azure_function_verification is not in configuration)
  - resource "cloudflare_record" "cache_azure_function_verification" {
      - allow_overwrite = false -> null
      - created_on      = "2024-03-10T23:38:24.26144Z" -> null
      - hostname        = "asuid.cache.tarkov.dev" -> null
      - id              = "2f52f776bbb5d137730086c7579663a4" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-03-10T23:38:24.26144Z" -> null
      - name            = "asuid.cache" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "966A35FCB4A0FE1176E2320038F9EA960F6E2FE36A69ABDFC79A272FE4E2228F" -> null
      - zone_id         = "a17204c79af55fcf05e4975f66e2490e" -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.
cloudflare_record.cache: Destroying... [id=180e6c5a5414843333d449244962bf01]
cloudflare_record.cache_azure_function_verification: Destroying... [id=2f52f776bbb5d137730086c7579663a4]
cloudflare_record.cache: Destruction complete after 0s
cloudflare_record.cache: Creating...
cloudflare_record.cache_azure_function_verification: Destruction complete after 0s
cloudflare_record.cache: Creation complete after 1s [id=65105596207eb686b256c9bb9cd17e23]

Apply complete! Resources: 1 added, 0 changed, 2 destroyed.

```

</details>
